/**
 * @author Abramov Maxim
 * @date 08.04.2023 16:08
 */
public class Main {
    public static void main(String[] args) {
        // Зашифруйте и расшифруйте слово с помощью шифра Виженера
        Task1.run("самосборка","щаруцшуцпл" ,"задел");

        // Произведите два раунда шифрования при помощи сети Фейстеля
        Task2.run("10100011110011110011", "0010010100", "0110110000");

        // Произведите один раунд шифрования при помощи алгоритма Rijndael
        String[][] state = {{"2b", "aa", "a7", "f2"},
                            {"d3", "2d", "c8", "2e"},
                            {"7b", "c6", "59", "54"},
                            {"70", "3a", "02", "8c"}};
        String[][] roundKey = {{"b7", "0c", "55", "e6"},
                               {"52", "3f", "15", "44"},
                               {"73", "68", "96", "29"},
                               {"64", "ec", "df", "7f"}};
        Task3.run(state, roundKey);

        // Посчитайте период регистра сдвига и в урезанной версии RC-4 провести n тактов
        Task4.run("110010", new Integer[]{5, 4, 3},
                new Integer[]{11, 4, 10, 3, 5, 0, 2, 1, 9, 8, 7, 6}, 12, 5);

        // Зашифруйте и дешифруйте сообщение с помощью алгоритма RSA
        Task5.run("Пикассо", 13,199,827,
                "04353523275817212052", 3247, 4853);

        // Создайте при помощи алгоритма DSA цифровую подпись
        Task6.run("166463376516400426457141515104566173785856035498896721857360191000830037660746843986602958707228415904253202234300944501270586733632418193908609869522918666622719348429564638751664928414142733358346373069590470043643120383033778157172431539992689397303360775161135822672339278566888972237062904143856449494121",
                "800639140554576815355142856850966681154603819183",
                "25023825924299564725223445047359641289150680212074757345632412296768112224011958375110364984100703119978015411128467189756940390362310345135543390310055478159471967765083076992415072847471209888076243150438305612399766814782976986655686373462542738634533732066661512634533218739435839206612529941279491181770",
                "537745557718734956418968819717440405817477740120",
                "163142036525505604391766718652009268100024523186",
                "1452173985408750203318475117189636062911214042143");

        // В качестве зачетного задания предлагается произвести дешифровку некоторого сообщения.
        Exam.run("src/array_int_parts_3.csv", "src/array_remainders_3.csv", 8135, 97, 149);
    }
}
